app/controllers/info_status_controller.rb

  def index
    response.headers["Access-Control-Allow-Origin"] = "*"
    infos = InfoStatus.all
---
SELECT "info_statuses".* FROM "info_statuses"

  def create
    response.headers["Access-Control-Allow-Origin"] = "*"
    info = InfoStatus.new
    info.text = params[:text]
    info.save
---
INSERT INTO "info_statuses" ("created_at", "text", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Sun, 23 Feb 2014 11:02:08 UTC +00:00], ["text", "toto aime les frites"], ["updated_at", Sun, 23 Feb 2014 11:02:08 UTC +00:00]]

  def show
    response.headers["Access-Control-Allow-Origin"] = "*"
    info = InfoStatus.find(params[:id])
---
SELECT "info_statuses".* FROM "info_statuses" WHERE "info_statuses"."id" = $1 LIMIT 1  [["id", "1"]]