app/controllers/offer_controller.rb

  def index
    @offers = Offer.all
---
SELECT "offers".* FROM "offers"

  def create
    @offer = Offer.new
    @offer.title = params[:title]
    @offer.description = description[:description]
    @offer.save
---
INSERT INTO "offers" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 23 Feb 2014 01:07:42 UTC +00:00], ["description", "tata"], ["title", "toto"], ["updated_at", Sun, 23 Feb 2014 01:07:42 UTC +00:00]]

  def show
    @offer = Offer.find(params[:id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT 1  [["id", "list"]]

  def search
    q = "%#{params[:keyword]}%"
    offers = Offer.where("title LIKE ? OR description LIKE ?", q, q)
---
SELECT "offers".* FROM "offers" WHERE (title LIKE '%toto%' OR description LIKE '%toto%';)