app/controllers/student_controller.rb

  def index
    students = Student.all
---
SELECT "students".* FROM "students"

  def show
    response.headers["Access-Control-Allow-Origin"] = "*"
    student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", "checkPassword"]]

  def checkPassword
    response.headers["Access-Control-Allow-Origin"] = "*"
    q1 = "#{params[:email]}"
    q2 = "#{params[:password]}"
    student = Student.where("email = ? AND password = ?", q1, q2)
---
SELECT "students".* FROM "students" WHERE (email = '123456@gmail.com' AND password = '123456')

  def create
    response.headers["Access-Control-Allow-Origin"] = "*"
    student = Student.new
    student.email = params[:email]
    student.firstname = params[:firstname]
    student.lastname = params[:lastname]
    student.password = params[:password]
    student.save
---
INSERT INTO "students" ("created_at", "email", "firstname", "lastname", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sun, 23 Feb 2014 04:41:24 UTC +00:00], ["email", "toto@gmail.com"], ["firstname", nil], ["lastname", nil], ["updated_at", Sun, 23 Feb 2014 04:41:24 UTC +00:00]]